IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/LIN0_LIN0.xml
	<register id="LIN0_LINRD1" acronym="LIN0_LINRD1" offset="0x68" width="32" description="The LINRD1 regsiter contains the upper 4 bytes of the received LIN frame data.">
		<bitfield id="RD4" width="8" begin="31" end="24" resetval="0x0" description="8-bit Receive Buffer 4 Each response data-byte that is received in the SCIRXSHFT register is transferred to the corresponding RDy register according to the number of bytes received." range="31 - 24" rwaccess="R"/> 
		<bitfield id="RD5" width="8" begin="23" end="16" resetval="0x0" description="8-bit Receive Buffer 5.Each response data-byte that is received in the SCIRXSHFT register is transferred to the corresponding RDy register according to the number of bytes received." range="23 - 16" rwaccess="R"/> 
		<bitfield id="RD6" width="8" begin="15" end="8" resetval="0x0" description="8-bit Receive Buffer 6.Each response data-byte that is received in the SCIRXSHFT register is transferred to the corresponding RDy register according to the number of bytes received." range="15 - 8" rwaccess="R"/> 
		<bitfield id="RD7" width="8" begin="7" end="0" resetval="0x0" description="8-bit Receive Buffer 7.Each response data-byte that is received in the SCIRXSHFT register is transferred to the corresponding RDy register according to the number of bytes received." range="7 - 0" rwaccess="R"/>
	</register>
	<register id="LIN0_LINMASK" acronym="LIN0_LINMASK" offset="0x6C" width="32" description="The LINMASK register is used to configure the masks used for filtering incoming ID messages for receive and transmit frames.">
		<bitfield id="RXIDMASK" width="8" begin="23" end="16" resetval="0x0" description="Receive ID mask.This field is effective in LIN mode only.This 8-bit mask is used for filtering an incoming ID message and compare it to the ID-byte. A compare match of the received ID witht the RX ID mask will set the ID RX flag and trigger and ID interrupt if enabled. A 0 bit in the mask indicates that bit is compared to the ID-byte. A 1 bit in the mask indicates that that bit is filtered and therefore not used in the compare. When HGENCTRL is set to 1, this field must be set to 0xFF." range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="TXIDMASK" width="8" begin="7" end="0" resetval="0x0" description="Transmit ID mask.This field is effective in LIN mode only. This 8-bit mask is used for filtering an incoming ID message and compare it to the ID-byte. A compare match of the received ID with the TX ID Mask will set the ID TX flag and trigger an ID interrupt if enabled. A 0 bit in the mask indicates that bit is compared to the ID-byte. A 1 bit in the mask indicates that bit is filtered and therefore not used for the compare. When HGENCTRL is set to 1, this field must be set to 0xFF." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="LIN0_LINID" acronym="LIN0_LINID" offset="0x70" width="32" description="The LINID register contains the identification fields for LIN communication.[[br]]NOTE: For software compatibility with future LIN modules, the HGEN CTRL bit must be set to 1, the RX ID MASK field must be set to FFh, and the TX ID MASK field must be set to FFh.">
		<bitfield id="RECEIVEDID" width="8" begin="23" end="16" resetval="0x0" description="Received ID.This bit is effective in LIN mode only. This byte contains the current message identifier. During header reception the received ID is copied from the SCIRXSHF register to this byte if there is no ID-parity error and there has been an RX/TX match.Note: If a framing error [FE] is detected during ID reception, the received ID will also not be copied to the LINID register." range="23 - 16" rwaccess="R"/> 
		<bitfield id="IDSLAVETASKBYTE" width="8" begin="15" end="8" resetval="0x0" description="ID Slave Task byte.This field is effective in LIN mode only. This byte contains the identifier to which the received ID of an incoming header will be compared in order to decide whether a RX response, a TX response, or no action needs to be done by the LIN node.  These bits are writable in LIN mode only." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="IDBYTE" width="8" begin="7" end="0" resetval="0x0" description="ID byte.This field is effective in LIN mode only. This byte is the LIN mode message ID. On a master node, a write to this register by the CPU initiates a header transmission. For a slave task, this byte is used for message filtering when HGENCTRL [SCIGCR1.12] is '0'. These bits are writable in LIN mode only." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="LIN0_LINTD0" acronym="LIN0_LINTD0" offset="0x74" width="32" description="The LINTD0 register contains the lower 4 bytes of the data to be transmitted.[[br]]NOTE: TD&#38;#60;x-1> is equivalent to Data byte &#38;#60;x> of the LIN frame.">
		<bitfield id="TD0" width="8" begin="31" end="24" resetval="0x0" description="8-bit Transmit Buffer 0.Byte 0 to be transmitted is written into this register and then copied to SCITXSHF for transmission. Once byte 0 is written in TDO buffer, transmission will be initiated." range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="TD1" width="8" begin="23" end="16" resetval="0x0" description="8-bit Transmit Buffer 3.Byte 1 to be transmitted is written into this register and then copied to SCITXSHF for transmission." range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="TD2" width="8" begin="15" end="8" resetval="0x0" description="8-bit Transmit Buffer 2.Byte 2 to be transmitted is written into this register and then copied to SCITXSHF for transmission." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="TD3" width="8" begin="7" end="0" resetval="0x0" description="8-bit Transmit Buffer 3.Byte 3 to be transmitted is written into this register and then copied to SCITXSHF for transmission." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="LIN0_LINTD1" acronym="LIN0_LINTD1" offset="0x78" width="32" description="The LINTD1 register contains the upper 4 bytes of the data to be transmitted.[[br]]NOTE: TD&#38;#60;x-1> is equivalent to Data byte &#38;#60;x> of the LIN frame.">
		<bitfield id="TD4" width="8" begin="31" end="24" resetval="0x0" description="8-bit Transmit Buffer 4.Byte4 to be transmitted is written into this register and then copied to SCITXSHF for transmission." range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="TD5" width="8" begin="23" end="16" resetval="0x0" description="8-bit Transmit Buffer 5.Byte 5 to be transmitted is written into this register and then copied to SCITXSHF for transmission. " range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="TD6" width="8" begin="15" end="8" resetval="0x0" description="8-bit Transmit Buffer 6.Byte 6 to be transmitted is written into this register and then copied to SCITXSHF for transmission." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="TD7" width="8" begin="7" end="0" resetval="0x0" description="8-bit Transmit Buffer 7.Byte 7 to be transmitted is written into this register and then copied to SCITXSHF for transmission." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="LIN0_MBRSR" acronym="LIN0_MBRSR" offset="0x7C" width="32" description="The MBRSR register is used to configure the expected maximum baud rate of the LIN network.">
		<bitfield id="MBR" width="13" begin="12" end="0" resetval="0x3500" description="Maximum Baud Rate Prescaler.This field is effective in LIN mode only. This 13-bit prescaler is used during the synchronization phase [see the Header Reception and Adaptive Baudrate section] of a slave module if the ADAPT bit is set. In this way, a SCI/LIN slave using an automatic or select bit rate modes detects any LIN bus legal rate automatically. The MBR value should be programmed to allow a maximum baud rate that is not more than 10% above the expected operating baud rate in the LIN network. Otherwise a s 0x00 data byte could mistakenly be detected as sync break.The default value is for a 70MHz LINCLK [0xDAC].This MBR prescaler is used by the wake-up and idle time counters for a constant expiration time relative to a 20kHz rate." range="12 - 0" rwaccess="R/W"/>
	</register>
	<register id="LIN0_Reserved_1" acronym="LIN0_Reserved_1" offset="0x80" width="32" description="tbd">
		
	</register>
	<register id="LIN0_IODFTCTRL" acronym="LIN0_IODFTCTRL" offset="0x90" width="32" description="The IODFTCTRL register is used to emulate various error and test conditions.">
		<bitfield id="BERRENA" width="1" begin="31" end="31" resetval="0x0" description="Bit Errror Enable bit.This bit is effective in LIN mode only. This bit is used to create a Bit error. When this bit is set, the bit received is ORed with 1 and passed to the Bit monitor circuitry." range="31" rwaccess="R/W"/> 
		<bitfield id="PBERRENA" width="1" begin="30" end="30" resetval="0x0" description="Physical Bus Error Enable bit.This bit is effective in LIN mode only. This bit is used to create a Physical Bus Error. When this bit is set, the bit received during Sync Break field transmission is ORed with 1 and passed to the Bit monitor circuitry" range="30" rwaccess="R/W"/> 
		<bitfield id="CERRENA" width="1" begin="29" end="29" resetval="0x0" description="Checksum Error Enable bit.This bit is effective in LIN mode only. This bit is used to create a checksum error. When this bit is set, the polarity of the CTYPE [checksum type] in the receive checksum calculator is changed so that a checksum error is generated." range="29" rwaccess="R/W"/> 
		<bitfield id="ISFERRENA" width="1" begin="28" end="28" resetval="0x0" description="Inconsistent Sync Field Error Enable bit.This bit is effective in LIN mode only. This bit is used to create an ISF error. When this bit is set, the bit widths in the sync field are varied so that the ISF check fails and the error flag is set." range="28" rwaccess="R/W"/> 
		<bitfield id="FERRENA" width="1" begin="26" end="26" resetval="0x0" description="This bit is used to create a Frame Error.This bit is effective in SCI-compatible mode only. When this bit is set, the stop bit received is ANDed with '0' and passed to the stop bit check circuitry." range="26" rwaccess="R/W"/> 
		<bitfield id="PERRENA" width="1" begin="25" end="25" resetval="0x0" description="Compatible Mode onlyThis bit is effective in SCI-compatible mode only. This bit is used to create a Parity Error. When this bit is set, in compatible mode, the parity bit received is toggled so that a parity error occurs." range="25" rwaccess="R/W"/> 
		<bitfield id="BRKDTERRENA" width="1" begin="24" end="24" resetval="0x0" description="Compatible Mode onlyThis bit is effective in SCI-compatible mode only. This bit is used to create BRKDT error [SCI mode only]. When this bit is set, the stop bit of the frame is ANDed with '0' and passed to the RSM so that a frame error occurs. Then the RX Pin is forced to continuous low for 10 Tbits so that a BRKDT error occurs." range="24" rwaccess="R/W"/> 
		<bitfield id="PINSAMPLEMASK" width="2" begin="20" end="19" resetval="0x0" description="Pin sample mask.These bits define the sample number at which the TX Pin value that is being transmitted will be inverted to verify the receive pin samples correctly with the majority detection circuitry.Note: During IODFT mode testing for the pin sample mask, the prescalar P must be programmed to be greater than 2." range="20 - 19" rwaccess="R/W"/> 
		<bitfield id="TXSHIFT" width="3" begin="18" end="16" resetval="0x0" description="Transmit shift.These bits define the delay by which the value on LINTX is delayed so that the value on LINRX is asynchronous. [Not applicable to Start Bit]" range="18 - 16" rwaccess="R/W"/> 
		<bitfield id="IODFTENA" width="4" begin="11" end="8" resetval="0x5" description="IO DFT Enable KeyThis field is used to enable the IODFT mode of the SCI/LIN module for testing. " range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="LPBENA" width="1" begin="1" end="1" resetval="0x0" description="Module loopback enable.In analog loopback mode the complete communication path through the I/Os can be tested, whereas in digital loopback mode the I/O buffers are excluded from this path." range="1" rwaccess="R/W"/> 
		<bitfield id="RXPENA" width="1" begin="0" end="0" resetval="0x0" description="Module Analog loopback through receive pin enable.This bit defines whether the I/O buffers for the transmit or the receive pin are included in the communication path in analog loopback mode only." range="0" rwaccess="R/W"/>
	</register>
	<register id="LIN0_Reserved_2" acronym="LIN0_Reserved_2" offset="0x94" width="32" description="tbd">
		
	</register>
	<register id="LIN0_LIN_GLB_INT_EN" acronym="LIN0_LIN_GLB_INT_EN" offset="0xE0" width="32" description="The LIN_GLB_INT_EN register is used to enable the INT0 and INT1 interrupt lines to propagate to the PIE block.">
		<bitfield id="GLBINT1_EN" width="1" begin="1" end="1" resetval="0x0" description="Global Interrupt Enable for LIN INT1.This bit determines whether the INT1 interrupt line generates an interrupt to the PIE or not" range="1" rwaccess="R/W"/> 
		<bitfield id="GLBINT0_EN" width="1" begin="0" end="0" resetval="0x0" description="Global Interrupt Enable for LIN INT0.This bit determines whether the INT0 interrupt line generates an interrupt to the PIE or not." range="0" rwaccess="R/W"/>
	</register>
	<register id="LIN0_LIN_GLB_INT_FLG" acronym="LIN0_LIN_GLB_INT_FLG" offset="0xE4" width="32" description="The LIN_GLB_INT_FLG register contains the current status of the INT0 and INT1 flags.">
		<bitfield id="INT1_FLG" width="1" begin="1" end="1" resetval="0x0" description="Global Interrupt Flag for LIN INT1.This bit indicates if an interrupt was generated to the PIE due to an enabled interrupt on the INT1 interrupt line. Refer to the LIN Interrupt Status Register for the condition that generated the interrupt.This bit can be cleared by writing a 1 to the corresponding bit in the LIN_GLB_INT_CLR register." range="1" rwaccess="R"/> 
		<bitfield id="INT0_FLG" width="1" begin="0" end="0" resetval="0x0" description="Global Interrupt Flag for LIN INT0.This bit indicates if an interrupt was generated to the PIE due to an enabled interrupt on the INT0 interrupt line. Refer to the LIN Interrupt Status Register for the condition that generated the interrupt.This bit can be cleared by writing a 1 to the corresponding bit in the LIN_GLB_INT_CLR register." range="0" rwaccess="R"/>
	</register>
	<register id="LIN0_LIN_GLB_INT_CLR" acronym="LIN0_LIN_GLB_INT_CLR" offset="0xE8" width="32" description="The LIN_GLB_INT_CLR register is used to clear the interrupt flags in LIN_GLB_INT_FLG register.">
		<bitfield id="INT1_FLG_CLR" width="1" begin="1" end="1" resetval="0x0" description="Global Interrupt flag clear for LIN INT1.This bit is used to clear the corresponding bit in the LIN_GLB_INT_FLG register. Write 1 to clear the INT1_FLG bit. Writing 0 has no effect." range="1" rwaccess="R/W1TC"/> 
		<bitfield id="INT0_FLG_CLR" width="1" begin="0" end="0" resetval="0x0" description="Global Interrupt flag clear for LIN INT0.This bit is used to clear the corresponding bit in the LIN_GLB_INT_FLG register. Write 1 to clear the INT0_FLG bit. Writing 0 has no effect." range="0" rwaccess="R/W1TC"/>
	</register>
</module>